###################################################################

# Created by write_sdc on Thu Jun  6 13:56:17 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {out_max_value[11]}]
set_load -pin_load 0.05 [get_ports {out_max_value[10]}]
set_load -pin_load 0.05 [get_ports {out_max_value[9]}]
set_load -pin_load 0.05 [get_ports {out_max_value[8]}]
set_load -pin_load 0.05 [get_ports {out_max_value[7]}]
set_load -pin_load 0.05 [get_ports {out_max_value[6]}]
set_load -pin_load 0.05 [get_ports {out_max_value[5]}]
set_load -pin_load 0.05 [get_ports {out_max_value[4]}]
set_load -pin_load 0.05 [get_ports {out_max_value[3]}]
set_load -pin_load 0.05 [get_ports {out_max_value[2]}]
set_load -pin_load 0.05 [get_ports {out_max_value[1]}]
set_load -pin_load 0.05 [get_ports {out_max_value[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  5  [get_ports in_valid]
set_input_delay -clock clk  5  [get_ports {in_a1[5]}]
set_input_delay -clock clk  5  [get_ports {in_a1[4]}]
set_input_delay -clock clk  5  [get_ports {in_a1[3]}]
set_input_delay -clock clk  5  [get_ports {in_a1[2]}]
set_input_delay -clock clk  5  [get_ports {in_a1[1]}]
set_input_delay -clock clk  5  [get_ports {in_a1[0]}]
set_input_delay -clock clk  5  [get_ports {in_a2[5]}]
set_input_delay -clock clk  5  [get_ports {in_a2[4]}]
set_input_delay -clock clk  5  [get_ports {in_a2[3]}]
set_input_delay -clock clk  5  [get_ports {in_a2[2]}]
set_input_delay -clock clk  5  [get_ports {in_a2[1]}]
set_input_delay -clock clk  5  [get_ports {in_a2[0]}]
set_input_delay -clock clk  5  [get_ports {in_b[11]}]
set_input_delay -clock clk  5  [get_ports {in_b[10]}]
set_input_delay -clock clk  5  [get_ports {in_b[9]}]
set_input_delay -clock clk  5  [get_ports {in_b[8]}]
set_input_delay -clock clk  5  [get_ports {in_b[7]}]
set_input_delay -clock clk  5  [get_ports {in_b[6]}]
set_input_delay -clock clk  5  [get_ports {in_b[5]}]
set_input_delay -clock clk  5  [get_ports {in_b[4]}]
set_input_delay -clock clk  5  [get_ports {in_b[3]}]
set_input_delay -clock clk  5  [get_ports {in_b[2]}]
set_input_delay -clock clk  5  [get_ports {in_b[1]}]
set_input_delay -clock clk  5  [get_ports {in_b[0]}]
set_output_delay -clock clk  5  [get_ports out_valid]
set_output_delay -clock clk  5  [get_ports {out_max_value[11]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[10]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[9]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[8]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[7]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[6]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[5]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[4]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[3]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[2]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[1]}]
set_output_delay -clock clk  5  [get_ports {out_max_value[0]}]
